Desafio_webSock/Desafio_webSock/profiling/autocannon_info_con_console.out
PS C:\Users\U632510\Documents\git_repos\coder_bakend\Desafio_webSock\Desafio_webSock> npx autocannon -c 100 -d 20 http://localhost:8080/info?consologear=true
Running 20s test @ http://localhost:8080/info?consologear=true
100 connections


┌─────────┬────────┬────────┬────────┬────────┬───────────┬──────────┬────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev    │ Max    │
├─────────┼────────┼────────┼────────┼────────┼───────────┼──────────┼────────┤
│ Latency │ 239 ms │ 248 ms │ 270 ms │ 283 ms │ 249.91 ms │ 12.77 ms │ 395 ms │
└─────────┴────────┴────────┴────────┴────────┴───────────┴──────────┴────────┘
┌───────────┬────────┬────────┬────────┬────────┬────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Req/Sec   │ 354    │ 354    │ 398    │ 411    │ 397.05 │ 11.46   │ 354    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Bytes/Sec │ 238 kB │ 238 kB │ 268 kB │ 276 kB │ 267 kB │ 7.69 kB │ 238 kB │
└───────────┴────────┴────────┴────────┴────────┴────────┴─────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 20

8k requests in 20.04s, 5.34 MB read