Desafio_webSock/Desafio_webSock/profiling/autocannon_info_sin_console.out
PS C:\Users\U632510\Documents\git_repos\coder_bakend\Desafio_webSock\Desafio_webSock> npx autocannon -c 100 -d 20 http://localhost:8080/info
Running 20s test @ http://localhost:8080/info
100 connections


┌─────────┬────────┬────────┬────────┬────────┬───────────┬─────────┬────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev   │ Max    │
├─────────┼────────┼────────┼────────┼────────┼───────────┼─────────┼────────┤
│ Latency │ 131 ms │ 140 ms │ 152 ms │ 173 ms │ 140.32 ms │ 7.39 ms │ 224 ms │
└─────────┴────────┴────────┴────────┴────────┴───────────┴─────────┴────────┘
┌───────────┬────────┬────────┬────────┬────────┬────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Req/Sec   │ 639    │ 639    │ 712    │ 730    │ 708.75 │ 17.99   │ 639    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Bytes/Sec │ 430 kB │ 430 kB │ 479 kB │ 491 kB │ 476 kB │ 12.1 kB │ 429 kB │
└───────────┴────────┴────────┴────────┴────────┴────────┴─────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 20

14k requests in 20.05s, 9.53 MB read